while ( <DATA> ) {
	next if m{xxx} ;

	print
}

__END__
1:xxx:xxx
1:180:xxx
 Астероид [1:180:11] Мет:2,7 M / Крис:3,4 M / Дейт:0 Сбор Астероида
1:181:xxx
1:182:xxx
 Астероид [1:182:4] Мет:5,1 M / Крис:3,4 M / Дейт:0 Сбор Астероида
1:183:xxx
 Астероид [1:183:1] Мет:2,9 M / Крис:2,8 M / Дейт:0 Сбор Астероида
1:184:xxx
 Астероид [1:184:11] Мет:3,0 M / Крис:1,5 M / Дейт:0 Сбор Астероида
1:185:xxx
 Астероид [1:185:13] Мет:5,7 M / Крис:2,3 M / Дейт:0 Сбор Астероида
1:186:xxx
 Астероид [1:186:6] Мет:1,8 M / Крис:935 K / Дейт:0 Сбор Астероида
1:187:xxx
1:188:xxx
1:189:xxx
 Астероид [1:189:7] Мет:4,2 M / Крис:1,3 M / Дейт:0 Сбор Астероида
1:190:xxx
1:191:xxx
1:192:xxx
1:193:xxx
1:194:xxx
1:195:xxx
1:196:xxx
 Астероид [1:196:3] Мет:3,6 M / Крис:1,7 M / Дейт:0 Сбор Астероида
1:197:xxx
 Астероид [1:197:5] Мет:3,2 M / Крис:1,5 M / Дейт:0 Сбор Астероида
1:198:xxx
 Астероид [1:198:6] Мет:4,1 M / Крис:3,2 M / Дейт:0 Сбор Астероида
1:199:xxx
1:200:xxx
 Астероид [1:200:8] Мет:2,2 M / Крис:2,7 M / Дейт:0 Сбор Астероида
1:201:xxx
 Астероид [1:201:10] Мет:4,8 M / Крис:3,3 M / Дейт:0 Сбор Астероида
1:202:xxx
 Астероид [1:202:8] Мет:1,8 M / Крис:1,0 M / Дейт:0 Сбор Астероида
1:203:xxx
1:204:xxx
1:205:xxx
 Астероид [1:205:13] Мет:5,5 M / Крис:3,3 M / Дейт:0 Сбор Астероида
1:206:xxx
 Астероид [1:206:4] Мет:2,4 M / Крис:3,3 M / Дейт:0 Сбор Астероида
1:207:xxx
 Астероид [1:207:8] Мет:2,8 M / Крис:2,9 M / Дейт:0 Сбор Астероида
1:208:xxx
 Астероид [1:208:8] Мет:1,9 M / Крис:2,4 M / Дейт:0 Сбор Астероида
1:209:xxx
 Астероид [1:209:5] Мет:3,7 M / Крис:2,0 M / Дейт:0 Сбор Астероида
1:210:xxx
 Астероид [1:210:3] Мет:2,3 M / Крис:2,6 M / Дейт:0 Сбор Астероида
1:211:xxx
 Астероид [1:211:12] Мет:4,6 M / Крис:3,0 M / Дейт:0 Сбор Астероида
1:212:xxx
1:213:xxx
1:214:xxx
 Астероид [1:214:15] Мет:5,8 M / Крис:3,2 M / Дейт:0 Сбор Астероида
1:215:xxx
 Астероид [1:215:2] Мет:4,9 M / Крис:1,7 M / Дейт:0 Сбор Астероида
1:216:xxx
 Астероид [1:216:6] Мет:5,4 M / Крис:901 K / Дейт:0 Сбор Астероида
1:217:xxx
1:218:xxx
 Астероид [1:218:11] Мет:5,1 M / Крис:869 K / Дейт:0 Сбор Астероида
1:219:xxx
 Астероид [1:219:10] Мет:1,9 M / Крис:2,0 M / Дейт:0 Сбор Астероида
1:220:xxx
1:221:xxx
 Астероид [1:221:4] Мет:5,3 M / Крис:1,1 M / Дейт:0 Сбор Астероида
1:222:xxx
 Астероид [1:222:4] Мет:4,5 M / Крис:1,4 M / Дейт:0 Сбор Астероида
1:223:xxx
1:224:xxx
 Астероид [1:224:15] Мет:1,9 M / Крис:1,5 M / Дейт:0 Сбор Астероида
1:225:xxx
 Астероид [1:225:12] Мет:4,7 M / Крис:1,7 M / Дейт:0 Сбор Астероида
1:226:xxx
 Астероид [1:226:4] Мет:4,2 M / Крис:2,7 M / Дейт:0 Сбор Астероида
1:227:xxx
 Астероид [1:227:5] Мет:2,2 M / Крис:2,4 M / Дейт:0 Сбор Астероида
1:228:xxx
 Астероид [1:228:1] Мет:5,6 M / Крис:2,1 M / Дейт:0 Сбор Астероида
1:229:xxx
1:230:xxx
 Астероид [1:230:1] Мет:4,6 M / Крис:1,8 M / Дейт:0 Сбор Астероида
